nxp-appcodehub/an-lpc553x-dual-servo-motor-control/devices/LPC55S36/drivers/fsl_prince.c
#if defined(FSL_PRINCE_DRIVER_LPC55S3x)
static status_t PRINCE_CSS_generate_random(uint8_t *output, size_t outputByteLen);
static status_t PRINCE_CSS_check_key(uint8_t keyIdx, mcuxClCss_KeyProp_t *pKeyProp);
static status_t PRINCE_CSS_gen_iv_key(void);
static status_t PRINCE_CSS_enable(void);
static status_t PRINCE_CSS_calculate_iv(uint32_t *IvReg);

/*!
 * @brief Configures PRINCE setting.
 *
 * This function does the initial PRINCE configuration via ROM IAP API call.
 * PRINCE_SR_x configuration for each region configuration is stored into FFR (CMPA).
 * PRINCE IV erase counters (MCTR_INT_IV_CTRx) in CFPA are updated accordingly.
 *
 * Note: This function is expected to be called once in the device lifetime,
 * typically during the initial device provisioning, since it is programming the CMPA pages in PFR flash.
 *
 * @param coreCtx The pointer to the ROM API driver context structure.
 * @param config The pointer to the PRINCE driver configuration structure.
 *
 * @retval #kStatus_Success
 * @retval #kStatus_CommandUnsupported
 * @retval #kStatus_InvalidArgument
 * @retval #kStatus_FLASH_ModifyProtectedAreaDisallowed
 * @retval #kStatusMemoryRangeInvalid
 * @retval #kStatus_Fail
 * @retval #kStatus_OutOfRange
 * @retval #kStatus_SPI_BaudrateNotSupport
 */
status_t PRINCE_Configure(api_core_context_t *coreCtx, prince_prot_region_arg_t *config)
{
    /* Enable CSS and check keys */
    if (kStatus_Success != PRINCE_CSS_enable())
    {
        return kStatus_Fail;
    }

    return MEM_Config(coreCtx, (uint32_t *)config, kMemoryInternal);
}

/*!
 * @brief Configures PRINCE setting.
 *
 * This function is used to re-configure PRINCE IP based on configuration stored in FFR.
 * This function also needs to be called after wake up from power-down mode to regenerate IV
 * encryption key in CSS key store whose presence is necessary for correct PRINCE operation
 * during erase and write operations to encrypted regions of internal flash memory
 * (dependency for correct operation of MEM_Erase() and MEM_Write() after wake up from power-down mode).
 *
 * @param coreCtx The pointer to the ROM API driver context structure.
 *
 * @retval #kStatus_Success
 * @retval #kStatus_Fail
 */
status_t PRINCE_Reconfigure(api_core_context_t *coreCtx)
{
    status_t status = kStatus_Fail;
    uint64_t princeMask;
    uint32_t IvReg[4] = {0};
    uint32_t ivEraseCounter[3];
    uint32_t srEnable[3];
    uint32_t uuid[4];
    flash_config_t flash_config;
    uint32_t lockWord;
    uint8_t lock[3];

    /* Enable CSS and check keys */
    status = PRINCE_CSS_enable();
    if (kStatus_Success != status)
    {
        return kStatus_Fail;
    }

    /* Set PRINCE mask value. */
    status = PRINCE_CSS_generate_random((uint8_t *)&princeMask, sizeof(princeMask));
    if (kStatus_Success != status)
    {
        return kStatus_Fail;
    }
    PRINCE_SetMask(PRINCE, princeMask);

    /* Clean up Flash driver structure and Init*/
    memset(&flash_config, 0, sizeof(flash_config_t));
    if (FLASH_Init(&flash_config) != kStatus_Success)
    {
        return kStatus_Fail;
    }

    /* FFR Init */
    if (FFR_Init(&flash_config) != kStatus_Success)
    {
        return kStatus_Fail;
    }

    /* Get UUID from FFR */
    status = FFR_GetUUID(&flash_config, (uint8_t *)uuid);
    if (kStatus_Success != status)
    {
        return kStatus_Fail;
    }

    /* Check version of CFPA scratch first */
    uint32_t cfpaScratchVer = 0u;
    memcpy(&cfpaScratchVer, (void *)(CFPA_SCRATCH_VER), sizeof(uint32_t));

    /* Get CFPA version using FFR ROM API */
    uint32_t cfpaVer = 0u;
    if (kStatus_Success !=
        FFR_GetCustomerInfieldData(&flash_config, (uint8_t *)&cfpaVer, CFPA_VER_OFFSET, sizeof(uint32_t)))
    {
        status = kStatus_Fail;
        return status;
    }

    /* Compare the version of CFPA scratch and version of CFPA returned by ROM API */
    if (cfpaScratchVer > cfpaVer)
    {
        /* Get PRINCE_IV_CTRs from CFPA scratch */
        memcpy(&ivEraseCounter, (void *)CFPA_SCRATCH_IV, sizeof(uint32_t) * PRINCE_REGION_COUNT);
    }
    else
    {
        /* Get PRINCE_IV_CTRs IVs from CFPA ping/pong page */
        status = FFR_GetCustomerInfieldData(&flash_config, (uint8_t *)ivEraseCounter, CFPA_PRINCE_IV_OFFSET,
                                            sizeof(uint32_t) * PRINCE_REGION_COUNT);
        if (kStatus_Success != status)
        {
            return kStatus_Fail;
        }
    }

    /* Get PRINCE sub-region enable word from FFR */
    status = FFR_GetCustomerData(&flash_config, (uint8_t *)srEnable, CMPA_PRINCE_SR_OFFSET,
                                 sizeof(uint32_t) * PRINCE_REGION_COUNT);
    if (kStatus_Success != status)
    {
        return kStatus_Fail;
    }

    /* Get PRINCE lock setting from FFR */
    status = FFR_GetCustomerData(&flash_config, (uint8_t *)&lockWord, CMPA_PRINCE_LOCK_OFFSET, sizeof(uint32_t));
    if (kStatus_Success != status)
    {
        return kStatus_Fail;
    }

    lock[0] = (lockWord & PRINCE_BASE_ADDR_LOCK_REG0_MASK) >> PRINCE_BASE_ADDR_LOCK_REG0_SHIFT;
    lock[1] = (lockWord & PRINCE_BASE_ADDR_LOCK_REG1_MASK) >> PRINCE_BASE_ADDR_LOCK_REG1_SHIFT;
    lock[2] = (lockWord & PRINCE_BASE_ADDR_LOCK_REG2_MASK) >> PRINCE_BASE_ADDR_LOCK_REG2_SHIFT;

    /* Iterate for all internal PRINCE regions */
    for (prince_region_t region = kPRINCE_Region0; region <= kPRINCE_Region2; region++)
    {
        /* Set region base address. Should be always 0x0 on LPC55S36 */
        status = PRINCE_SetRegionBaseAddress(PRINCE, (prince_region_t)region, 0x0u);
        if (kStatus_Success != status)
        {
            return kStatus_Fail;
        }

        status = PRINCE_SetRegionSREnable(PRINCE, region, srEnable[region]);
        if (kStatus_Success != status)
        {
            return kStatus_Fail;
        }

        /* Prepare ivSeed for current region */
        IvReg[0] = uuid[0];
        IvReg[1] = uuid[1];
        IvReg[2] = uuid[2] ^ region;
        IvReg[3] = ivEraseCounter[region];

        /* Calculate IV as IvReg = AES_ECB_ENC(DUK_derived_key, {ctx_erase_counter, ctx_id}) */
        status = PRINCE_CSS_calculate_iv(IvReg);
        if (status != kStatus_Success)
        {
            return kStatus_Fail;
        }

        /* Load IV into PRINCE registers */
        status = PRINCE_SetRegionIV(PRINCE, (prince_region_t)region, (uint8_t *)IvReg);
        if (status != kStatus_Success)
        {
            return kStatus_Fail;
        }

        /* Lock region if required */
        if ((lock[region] == 0x1u) || (lock[region] == 0x2u) || (lock[region] == 0x3u))
        {
            PRINCE_SetLock(PRINCE, (kPRINCE_Region0Lock << region));
        }
    }

    /* Break the main loop in case that error occured during PRINCE configuration */
    if (status != kStatus_Success)
    {
        return kStatus_Fail;
    }

    /* When ENC_ENABLE is set, reading from PRINCE-encrypted regions is disabled. */
    /* For LPC55S36, the ENC_ENABLE is self-cleared after programming memory. */
    PRINCE_EncryptDisable(PRINCE);
    return status;
}

